# WorksharingDisplayGraphicSettings Class

---
Represents the graphical settings that can be assigned to elements in the worksharing display modes.
SystemObject Autodesk.Revit.DBWorksharingDisplayGraphicSettings
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class WorksharingDisplayGraphicSettings : IDisposable

    Public Class WorksharingDisplayGraphicSettings
    	Implements IDisposable

    public ref class WorksharingDisplayGraphicSettings : IDisposable

    type WorksharingDisplayGraphicSettings =
        class
            interface IDisposable
        end
The WorksharingDisplayGraphicSettings type exposes the following members.
| Name| Description
---|---|---
| WorksharingDisplayGraphicSettings|  Creates a new instance.
Top
| Name| Description
---|---|---
| FillColor|  The fill color that will be applied to elements when these settings are applied. Note that this is automatically set by increasing the luma of the specified line color by 65%.
| IsApplied|  Indicates whether this set of graphic overrides will be applied.
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| LineColor|  The line color that will be applied to elements when these settings are applied.
Top
| Name| Description
---|---|---
| Dispose| Releases all resources used by the WorksharingDisplayGraphicSettings
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB Namespace